test-scripts/coupon_concurrency_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="쿠폰 발급 동시성 부하 테스트" enabled="true">
      <stringProp name="TestPlan.comments">
[목적] 100명 동시 요청 시 쿠폰 재고(10개) 초과 발급 방지 검증

[Thread Group 구성]
  TG1 (활성)   : POST /api/coupons/issue        동기 - Pessimistic Lock
  TG2 (비활성) : POST /api/coupons/issue/async  비동기 - Redis Queue
  TG3 (비활성) : POST /api/coupons/issue/kafka  비동기 - Kafka

[사전 준비]
  1. 서버 기동    : ./gradlew bootRun  (포트 8080)
  2. Kafka 기동   : docker-compose up -d  (TG2/TG3 사용 시)
  3. DB 확인      : coupon_id=1 에 재고 10개, 사용자 ID 1~100 존재

[결과 해석 - TG1]
  성공(201 Created)  : 10건 이하  → 동시성 제어 정상
  거절(409/4xx)      : 90건 이상  → 재고 초과 방지 동작
  서버오류(5xx)      : 0건        → 예외 처리 정상

[결과 파일]
  test-scripts/results/sync_issue_summary.csv
  test-scripts/results/async_redis_summary.csv
  test-scripts/results/kafka_issue_summary.csv
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments"
                   testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SERVER_HOST" elementType="Argument">
            <stringProp name="Argument.name">SERVER_HOST</stringProp>
            <stringProp name="Argument.value">${__P(SERVER_HOST,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SERVER_PORT" elementType="Argument">
            <stringProp name="Argument.name">SERVER_PORT</stringProp>
            <stringProp name="Argument.value">${__P(SERVER_PORT,8080)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="COUPON_ID" elementType="Argument">
            <stringProp name="Argument.name">COUPON_ID</stringProp>
            <stringProp name="Argument.value">${__P(COUPON_ID,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RESULTS_DIR" elementType="Argument">
            <stringProp name="Argument.name">RESULTS_DIR</stringProp>
            <stringProp name="Argument.value">${__P(RESULTS_DIR,test-scripts/results)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ================================================================
           TG1: 동기 쿠폰 발급 - Pessimistic Lock (SELECT ... FOR UPDATE)
           POST /api/coupons/issue
           X-USER-ID 헤더: 스레드 번호(1~100) 사용 → 각각 다른 사용자
           기대: 재고 10개이면 201 Created 10건, 나머지 90건은 4xx
           ================================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[TG1] 동기 - POST /api/coupons/issue" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- Synchronizing Timer: 100명이 모두 준비된 후 동시에 요청 발사 -->
        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer"
                   testname="Synchronizing Timer - 100명 동시 출발" enabled="true">
          <stringProp name="groupSize">100</stringProp>
          <!-- 10초 안에 100명이 집결하지 않으면 타임아웃 후 강제 해제 -->
          <stringProp name="timeoutInMs">10000</stringProp>
        </SyncTimer>
        <hashTree/>

        <!-- Content-Type: application/json + X-USER-ID: 스레드 번호 -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-USER-ID</stringProp>
              <stringProp name="Header.value">${__threadNum}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- HTTP Request: POST /api/coupons/issue -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/coupons/issue" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"couponId": ${COUPON_ID}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/coupons/issue</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- 5xx 응답은 서버 오류로 간주하여 실패 처리 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="5xx 응답 없음 검증" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">^5\d{2}$</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">서버 내부 오류(5xx) 발생 - 동시성 예외 처리 확인 필요</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <!-- test_type 20 = MATCH(1) + NOT(4) + OR(16) -->
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report - TG1 동기" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${RESULTS_DIR}/sync_issue_summary.csv</stringProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                         testname="Aggregate Report - TG1 동기" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
      <!-- END TG1 -->

      <!-- ================================================================
           TG2: 비동기 쿠폰 발급 - Redis Queue (FIFO)
           POST /api/coupons/issue/async
           기대: 100건 모두 202 Accepted (즉시 반환, 실제 처리는 백그라운드)
           [활성화 방법] enabled="false" → enabled="true" 로 변경
           ================================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[TG2] 비동기-Redis - POST /api/coupons/issue/async" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer"
                   testname="Synchronizing Timer - 100명 동시 출발" enabled="true">
          <stringProp name="groupSize">100</stringProp>
          <stringProp name="timeoutInMs">10000</stringProp>
        </SyncTimer>
        <hashTree/>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-USER-ID</stringProp>
              <stringProp name="Header.value">${__threadNum}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/coupons/issue/async" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"couponId": ${COUPON_ID}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/coupons/issue/async</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="5xx 응답 없음 검증" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">^5\d{2}$</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">서버 내부 오류(5xx) 발생 - 비동기 큐 처리 확인 필요</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report - TG2 Redis 비동기" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${RESULTS_DIR}/async_redis_summary.csv</stringProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                         testname="Aggregate Report - TG2 Redis 비동기" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
      <!-- END TG2 -->

      <!-- ================================================================
           TG3: 비동기 쿠폰 발급 - Kafka
           POST /api/coupons/issue/kafka
           기대: 100건 모두 202 Accepted (즉시 반환, Consumer가 비동기 처리)
           [활성화 방법] enabled="false" → enabled="true" 로 변경
           [주의] docker-compose up -d 으로 Kafka 기동 필요
           ================================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[TG3] Kafka - POST /api/coupons/issue/kafka" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer"
                   testname="Synchronizing Timer - 100명 동시 출발" enabled="true">
          <stringProp name="groupSize">100</stringProp>
          <stringProp name="timeoutInMs">10000</stringProp>
        </SyncTimer>
        <hashTree/>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-USER-ID</stringProp>
              <stringProp name="Header.value">${__threadNum}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/coupons/issue/kafka" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"couponId": ${COUPON_ID}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/coupons/issue/kafka</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="5xx 응답 없음 검증" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">^5\d{2}$</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">서버 내부 오류(5xx) 발생 - Kafka Producer 확인 필요</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report - TG3 Kafka" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${RESULTS_DIR}/kafka_issue_summary.csv</stringProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                         testname="Aggregate Report - TG3 Kafka" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
      <!-- END TG3 -->

    </hashTree>
  </hashTree>
</jmeterTestPlan>